# **SQL Murder Mystery**
*A crime has taken place and the detective needs your help. The detective gave you the crime scene report, but you somehow lost it. You vaguely remember that the crime was a murder that occurred sometime on Jan.15, 2018, and that it took place in SQL City.
Start by retrieving the corresponding crime scene report from the police department's database.*

In [1]:
# Importing libraries

import pandas as pd
import sqlite3 as sql

# SQLite is a C library that provides a lightweight disk-based database that doesnâ€™t require a separate server process and allows accessing the database using a nonstandard variant of the SQL query language.

## Setting up the connection
Establishing a connection to the police department's database in Python.

In [3]:
conn = sql.connect('sql-murder-mystery.db')
print(conn)

<sqlite3.Connection object at 0x000001EF60C771F0>

Retrieving the crime scene report for the murder that occurred on Jan.15, 2018, in SQL City.

In [4]:
query_1 = '''
SELECT * FROM crime_scene_report
WHERE city = 'SQL City'
AND type = 'murder'
AND date = '20180115';
'''
# To execute
pd.read_sql_query(query_1,conn)

,date,type,description,city
0,20180115,murder,Security footage shows that there were 2 witne...,SQL City

Checking the personal details of witnesses involved in the case and retrieving their names, addresses and any other relevant information.

In [5]:
query_2 = '''
SELECT * FROM person
WHERE address_street_name = 'Northwestern Dr'
ORDER BY address_number DESC
limit 4;
'''
pd.read_sql_query(query_2,conn)

,id,name,license_id,address_number,address_street_name,ssn
0,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949
1,17729,Lasonya Wildey,439686,3824,Northwestern Dr,917817122
2,53890,Sophie Tiberio,957671,3755,Northwestern Dr,442830147
3,73368,Torie Thalmann,773862,3697,Northwestern Dr,341559436

In [6]:
query_3 = '''
SELECT * FROM person
WHERE address_street_name = 'Franklin Ave'
AND name LIKE 'Annabel%';
'''
pd.read_sql_query(query_3,conn)

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143

Accessing the recorded interviews of witnesses conducted after the murder and gathering insights into their statements and potential clues.

In [7]:
query_4 = '''
SELECT * FROM interview
WHERE person_id IN ('14887','16371');
'''
pd.read_sql_query(query_4,conn)

   person_id                                         transcript
0      14887  I heard a gunshot and then saw a man run out. ...
1      16371  I saw the murder happen, and I recognized the ...

Investigating the gym database using details obtained from the crime scene report and witness interviews and looking for any gym-related information that might be relevant.

In [8]:
query_5 = '''
SELECT * FROM get_fit_now_member
WHERE id LIKE '48Z%'
AND membership_status = 'gold';
'''
pd.read_sql_query(query_5,conn)

      id  person_id           name  membership_start_date membership_status
0  48Z7A      28819   Joe Germuska               20160305              gold
1  48Z55      67318  Jeremy Bowers               20160101              gold

Examining the car details associated with the crime scene and retrieving information about the vehicles present during the incident.

In [9]:
query_6 = '''
SELECT * FROM drivers_license
WHERE plate_number LIKE '%H42W%';
'''
pd.read_sql_query(query_6,conn)

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,183779,21,65,blue,blonde,female,H42W0X,Toyota,Prius
1,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS
2,664760,21,71,black,black,male,4H42WR,Nissan,Altima

Identifing and collecting personal details mentioned in the previous query and it includes names, addresses and any additional details.

In [10]:
query_7 = '''
SELECT * FROM person
WHERE license_id IN ('183779', '423327', '664760');
'''
pd.read_sql_query(query_7,conn)

,id,name,license_id,address_number,address_street_name,ssn
0,51739,Tushar Chandra,664760,312,Phi St,137882671
1,67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",871539279
2,78193,Maxine Whitely,183779,110,Fisk Rd,137882671

Determining who is identified in the previous query as a member of the gym and utilizing the gym database to confirm their membership status.

In [11]:
query_8 = '''
SELECT * FROM get_fit_now_member
WHERE person_id IN ('51739', '67318', '78193');
'''
pd.read_sql_query(query_8,conn)

      id  person_id           name  membership_start_date membership_status
0  48Z55      67318  Jeremy Bowers               20160101              gold

# Murder is **JEREMY BOWERS**

Interviewing the murderer to get the clues of true mastermind who is behind the murder.

In [12]:
query_9 = '''
SELECT * FROM interview
WHERE person_id = '67318';
'''
pd.read_sql_query(query_9,conn)

   person_id                                         transcript
0      67318  I was hired by a woman with a lot of money. I ...

Working on the clues.

In [13]:
query_10 = '''
SELECT per.* , dl.hair_color, dl.gender, dl.car_make, dl.car_model, dl.height
FROM person as per
INNER JOIN drivers_license AS dl
ON dl.id = per.license_id
INNER JOIN facebook_event_checkin AS fb_event
ON fb_event.person_id = per.id
WHERE dl.hair_color = 'red'
AND dl.height BETWEEN 65 AND 67
AND dl.gender = 'female'
AND dl.car_make = 'Tesla'
AND dl.car_model = 'Model S';
'''
pd.read_sql_query(query_10,conn)

,id,name,license_id,address_number,address_street_name,ssn,hair_color,gender,car_make,car_model,height
0,99716,Miranda Priestly,202298,1883,Golden Ave,987756388,red,female,Tesla,Model S,66
1,99716,Miranda Priestly,202298,1883,Golden Ave,987756388,red,female,Tesla,Model S,66
2,99716,Miranda Priestly,202298,1883,Golden Ave,987756388,red,female,Tesla,Model S,66

# Real master-mind behind this crime is **MIRANDA PRIESTLY**